Reports/СостояниеПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СостояниеПроекта</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ДатыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыСогласования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСогласованияАрхитектором</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСогласованияДизайнером</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСогласованияЗаказчиком</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументИзменения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктыСогласованияКомплектовЗаказчиком</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостояниеЗамера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостояниеЗамера</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЗамера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗамера</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектЗамера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектИзменения</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ПроверитьГабаритныеЧертежи</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПриемкиПомещения</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПриемкиГабаритныхЧертежей</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДанныеИзделияЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеИзделияЗаказчика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеСАртикулом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИзделиеЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияЗаказчика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДанныеКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКомплекта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяПродолжительностьПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСогласований</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадияПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗамера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗамера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Изменения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проектный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Строительный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ОсновныеЭтапы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОсновныеЭтапы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Монтаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/НазначениеПодрядчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НазначениеПодрядчика</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комплект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
								<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПКД</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РКД</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производство</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ЧастичнаяОтгрузка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЧастичнаяОтгрузка</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредметыОтгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредметОтгрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Композиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Композиции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/СостояниеПроекта/Ext/ManagerModule.bsl
Функция ЗаполнитьПроектыНаСервере(мДобавленныеПроекты) Экспорт 
	
	СписокПроектов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Проекты.Ссылка КАК Значение,
	|	Проекты.Наименование КАК Представление,
	|	Проекты.Номер КАК Номер
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|ГДЕ
	|	НЕ Проекты.Ссылка В (&мДобавленныеПроекты)
	|	И НЕ Проекты.НеВыводитьНаДиаграмму
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер";
	
	Запрос.УстановитьПараметр("мДобавленныеПроекты", мДобавленныеПроекты);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокПроектов.Добавить(Выборка.Значение, Строка(Выборка.Номер) + " " + Выборка.Представление);
	КонецЦикла;
	
	Возврат СписокПроектов;
	
КонецФункции

Функция СоздатьФайлОтчета(ПутьКФайлу = "", ПолеВывода = Неопределено, Проекты = Неопределено, ТипФайла = Неопределено) Экспорт

	Если ПолеВывода = Неопределено Тогда
	
		ПолеВывода = Новый ТабличныйДокумент;	
	
	КонецЕсли;
	
	СформироватьОтчетНаСервере(ПолеВывода, Проекты);
	
	Если НЕ ПустаяСтрока(ПутьКФайлу) Тогда
	
		ПолеВывода.Записать(ПутьКФайлу, ?(ТипФайла = Неопределено, ТипФайлаТабличногоДокумента.PDF, ТипФайла));		
	
	КонецЕсли;
	
	
КонецФункции // СоздатьФайлОтчета()

Процедура СформироватьОтчетНаСервере(ПолеВывода, Проекты)
	
	Если Проекты = Неопределено Тогда
		Проекты = ЗаполнитьПроектыНаСервере(Новый Массив);
	КонецЕсли;
	
	ПолеВывода.Очистить(); 		
	Если Не ЗначениеЗаполнено(Проекты) Тогда
		Возврат;	
	КонецЕсли;
	
	стТаблицы = ПолучитьТаблицуДанных(Проекты);
	
	ВывестиДанные(стТаблицы, ПолеВывода);
	
КонецПроцедуры // СформироватьОтчетНаСервере()

Функция ПолучитьТаблицуДанных(Проекты)
	
	УстановитьПривилегированныйРежим(Истина);
	
	тзДанныеЗапрос 	= ЗаполнитьКомплектыИзделий(Проекты);
	
	тзЭтапы = Неопределено;
	
	тзДанные = РассчитатьПоля(тзДанныеЗапрос, тзЭтапы);
	
	Возврат Новый Структура("тзДанные, тзЭтапы", тзДанные, тзЭтапы);
	
КонецФункции // ПолучитьТаблицуДанных()     

Функция РассчитатьПоля(тзДанныеЗапрос, тзЭтапы) 
	
	ТипСтрока 	= Новый ОписаниеТипов("Строка");
	ТипДата 	= Новый ОписаниеТипов("Дата");
	ТипБулево 	= Новый ОписаниеТипов("Булево");
	ТипЧисло 	= Новый ОписаниеТипов("Число");
	
	тзДанные = Новый ТаблицаЗначений;
	тзДанные.Колонки.Добавить("ПроектНаименование", 			ТипСтрока);
	тзДанные.Колонки.Добавить("Номер",							ТипСтрока);
	тзДанные.Колонки.Добавить("КомплектКомпозиция");
	тзДанные.Колонки.Добавить("ИзделиеЗаказчика", 				ТипСтрока);
	тзДанные.Колонки.Добавить("КомплектКомпозицияНаименование", ТипСтрока);
	тзДанные.Колонки.Добавить("Помещение");
	тзДанные.Колонки.Добавить("ПомещениеНаименование", 			ТипСтрока);
	тзДанные.Колонки.Добавить("Согласовано", 					ТипДата);
	тзДанные.Колонки.Добавить("СогласованоАрхитектор", 			ТипСтрока);
	тзДанные.Колонки.Добавить("Приоритет");
	тзДанные.Колонки.Добавить("Состояние",						Новый ОписаниеТипов("СправочникСсылка.СтадииКомплекта"));
	тзДанные.Колонки.Добавить("СостояниеСтрока",				ТипСтрока);
	тзДанные.Колонки.Добавить("КрайТЗ", 						ТипДата);
	тзДанные.Колонки.Добавить("КрайСогласования", 				ТипДата);
	тзДанные.Колонки.Добавить("КрайПроектирование", 			ТипДата);
	тзДанные.Колонки.Добавить("КрайПроизводство", 				ТипДата);
	тзДанные.Колонки.Добавить("КрайРКД", 						ТипДата);
	тзДанные.Колонки.Добавить("КрайМонтаж", 					ТипДата);
	тзДанные.Колонки.Добавить("Договор", 						ТипДата);
	тзДанные.Колонки.Добавить("Редакция");
	тзДанные.Колонки.Добавить("ПодрядПроект",					ТипБулево);
	тзДанные.Колонки.Добавить("ПодрядРКД",						ТипБулево);
	тзДанные.Колонки.Добавить("ПодрядПроизводство",				ТипБулево);
	тзДанные.Колонки.Добавить("ЭтоКомпозиция",					ТипБулево);
	тзДанные.Колонки.Добавить("СогласованДизайнером",			ТипБулево);
	тзДанные.Колонки.Добавить("ОтгрузкаЧислом",					ТипЧисло); //0 - не отгружен, 1 - частичная отгрузка, 2 полностью отгружен
	тзДанные.Колонки.Добавить("ОсновнойЭтап");
	тзДанные.Колонки.Добавить("Переходы", 						ТипСтрока);
	
	НомерКомпозиции 		= 0;
	Номер			 		= 1;
	НомерВнутриКомпозиции 	= 0;
	
	мКомплект 			= Новый Массив;
	мИзделиеКомплект 	= Новый Массив;
	
	ТД 						= НачалоДня(ТекущаяДата());
	СекундВНеделе 			= 3600 * 24 * 7;
	ПустаяДата				= Дата(1, 1, 1);
	
	текущаяКомпозиция 	= Неопределено;
	текущийПроект 		= Неопределено;
	
	Для каждого х Из тзДанныеЗапрос Цикл  
		
		Если НЕ текущийПроект = х.Проект  Тогда
			
			НС = тзДанные.Добавить();
			НС.ПроектНаименование = Строка(х.ПроектНомер) + " " + х.ПроектНаименование; 
			текущийПроект = х.Проект; 
			Номер 			= 0;
			НомерКомпозиции = 0;
			НомерВнутриКомпозиции = 0;
			
		КонецЕсли;
		
		Если НЕ текущаяКомпозиция = х.Композиция И ЗначениеЗаполнено(х.Композиция) Тогда
			
			Номер = Номер + 1;
			
			НомерВнутриКомпозиции = 1;
			
			НС = тзДанные.Добавить();
			
			НомерКомпозиции 					= Номер;
			текущаяКомпозиция 					= х.Композиция;	
			НС.Номер 							= НомерКомпозиции;
			НС.КомплектКомпозиция 				= х.Композиция;
			НС.КомплектКомпозицияНаименование 	= х.КомпозицииНаименование;
			НС.Помещение 						= х.ПомещениеКомпозиции;
			НС.ПомещениеНаименование		 	= х.ПомещениеКомпозицииНаименование;
			НС.Приоритет 						= х.ПриоритетКомпозиция;
			НС.Состояние		 				= х.ТекущаяСтадияКомпозиция;
			НС.СостояниеСтрока	 				= х.ТекущаяСтадияКомпозицияСтрока;
			НС.КрайПроектирование 				= х.ВнешняяДатаОкончаниеПроектированияКомпозиции;
			НС.КрайТЗ 							= х.ВнешняяДатаОкончаниеТЗКомпозиции;
			НС.КрайСогласования 				= х.ВнешняяДатаОкончаниеСогласованияКомпозиции;
			НС.ОсновнойЭтап			 			= х.ОсновнойЭтапКомпозиции;
			НС.Редакция							= х.ПереходРедакцияКомпозиции;
			НС.ПодрядРКД						= х.ПодрядРКДКомпозиции;
			НС.ПодрядПроект						= х.ПодрядПроектКомпозиции;
			НС.ПодрядПроизводство				= х.ПодрядПроизводствоКомпозиции;
			НС.Переходы							= х.ПереходПредставлениеКомпозиции;
			НС.ЭтоКомпозиция					= Истина; 
			
			мКомплект.Добавить(х.Композиция);
			
		КонецЕсли;
		
		НС = тзДанные.Добавить();
		
		Если ЗначениеЗаполнено(х.Композиция) Тогда
			
			НомерВнутриКомпозиции = НомерВнутриКомпозиции + 1;
			
			НС.Номер 							=  Строка(НомерКомпозиции) + "." + НомерВнутриКомпозиции;
			НС.КомплектКомпозицияНаименование 	= "   " + х.КомплектНаименование;
			НС.КрайПроектирование 				= ПустаяДата;
			НС.КрайТЗ 							= ПустаяДата;
			НС.КрайСогласования 				= ПустаяДата;
			
		Иначе	
			
			Номер = Номер + 1;
			
			НС.Номер 							= Номер;
			НС.КомплектКомпозицияНаименование 	= х.КомплектНаименование;
			НС.КрайПроектирование 				= х.ВнешняяДатаОкончаниеПроектирования;
			НС.КрайТЗ 							= х.ВнешняяДатаОкончаниеТЗ;
			НС.КрайСогласования 				= х.ВнешняяДатаОкончаниеСогласования;
			
		КонецЕсли;
		
		НС.КомплектКомпозиция 				= х.ИзделиеКомплект;
		НС.Помещение 						= х.Помещение;                  
		НС.ПомещениеНаименование		 	= х.ПомещениеНаименование;
		НС.Приоритет 						= х.Приоритет;
		НС.Состояние		 				= х.ТекущаяСтадия;
		НС.СостояниеСтрока	 				= х.ТекущаяСтадияСтрока;
		НС.КрайПроизводство 				= х.ВнешняяДатаОкончаниеПроизводства;
		НС.КрайМонтаж 						= х.ВнешняяДатаОкончаниеМонтажа;
		НС.КрайРКД 							= х.ВнешняяДатаОкончаниеРКД;
		НС.ОсновнойЭтап			 			= х.ОсновнойЭтап;
		НС.Редакция							= х.ПереходРедакцияКомпозиции;
		НС.СогласованДизайнером				= х.СогласованДизайнером;
		НС.Переходы							= х.ПереходПредставление;
		НС.ПодрядРКД						= х.ПодрядРКД;
		НС.ПодрядПроект						= х.ПодрядПроект;
		НС.ПодрядПроизводство				= х.ПодрядПроизводство;
		НС.ЭтоКомпозиция					= Ложь;
		
		мКомплект.Добавить(х.ИзделиеКомплект);
		мИзделиеКомплект.Добавить(х.ИзделиеКомплект);
		
	КонецЦикла;
	
	тзДанные.Индексы.Добавить("КомплектКомпозиция");    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЧастичнаяОтгрузка.ИзделиеКомплект КАК ИзделиеКомплект
	|ИЗ
	|	Справочник.ЧастичнаяОтгрузка КАК ЧастичнаяОтгрузка
	|ГДЕ
	|	ЧастичнаяОтгрузка.ИзделиеКомплект В(&ИзделиеКомплект)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЧастичнаяОтгрузка.ИзделиеКомплект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтгрузкаГотовойПродукцииИзделияКомплекты.ИзделиеКомплект КАК ИзделиеКомплект
	|ИЗ
	|	Документ.ОтгрузкаГотовойПродукции.ИзделияКомплекты КАК ОтгрузкаГотовойПродукцииИзделияКомплекты
	|ГДЕ
	|	ОтгрузкаГотовойПродукцииИзделияКомплекты.ИзделиеКомплект В(&ИзделиеКомплект)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтгрузкаГотовойПродукцииИзделияКомплекты.ИзделиеКомплект";
	
	Запрос.УстановитьПараметр("ИзделиеКомплект", мКомплект);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденаяСтрока = тзДанные.Найти(Выборка.ИзделиеКомплект, "КомплектКомпозиция");
		Если НЕ НайденаяСтрока = Неопределено Тогда
			НайденаяСтрока.ОтгрузкаЧислом = 1;	
		КонецЕсли;
	КонецЦикла;
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденаяСтрока = тзДанные.Найти(Выборка.ИзделиеКомплект, "КомплектКомпозиция");
		Если НЕ НайденаяСтрока = Неопределено Тогда
			НайденаяСтрока.ОтгрузкаЧислом = 2;	
		КонецЕсли;
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатыСогласования.ДатаСогласованияАрхитектором КАК ДатаСогласованияАрхитектором,
	|	ДатыСогласования.ДатаСогласованияЗаказчиком КАК ДатаСогласованияЗаказчиком,
	|	ДатыСогласования.ДатаСогласованияДизайнером КАК ДатаСогласования,
	|	ДатыСогласования.Комплект КАК Комплект
	|ИЗ
	|	РегистрСведений.ДатыСогласования КАК ДатыСогласования
	|ГДЕ
	|	ДатыСогласования.Комплект В(&Комплект)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИзделияКомплектИзделияЭлемент.Ссылка КАК Комплект,
	|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокМонтажаВНеделях КАК СрокМонтажаВНеделях,
	|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокПроизводстваВНеделях КАК СрокПроизводстваВНеделях,
	|	МАКСИМУМ(ЕСТЬNULL(СостояниеЗамера.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК ДатаПринятияПомещения
	|ИЗ
	|	Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеЗамера КАК СостояниеЗамера
	|		ПО ИзделияКомплектИзделияЭлемент.Ссылка.ОсновноеПомещение = СостояниеЗамера.ОбъектЗамера
	|			И (СостояниеЗамера.СтатусЗамера = &СтатусЗамера)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПриложенияКДоговорам.ИзделияЗаказчика КАК ПриложенияКДоговорамИзделияЗаказчика
	|			ПО (ПриложенияКДоговорамИзделияЗаказчика.ИзделиеЗаказчика = ИзделияЗаказчикаИзделияЭлемент.Ссылка)
	|		ПО ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент = ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент
	|ГДЕ
	|	ИзделияКомплектИзделияЭлемент.Ссылка В(&Комплект)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзделияКомплектИзделияЭлемент.Ссылка,
	|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокМонтажаВНеделях,
	|	ПриложенияКДоговорамИзделияЗаказчика.Ссылка.СрокПроизводстваВНеделях
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИзделияКомплектИзделияЭлемент.Ссылка КАК Комплект,
	|	ДанныеИзделияЗаказчика.НаименованиеСАртикулом КАК ИзделияЗаказчикаНаименование
	|ИЗ
	|	Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЭлемент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИзделияЗаказчика.ИзделияЭлемент КАК ИзделияЗаказчикаИзделияЭлемент
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеИзделияЗаказчика КАК ДанныеИзделияЗаказчика
	|			ПО ИзделияЗаказчикаИзделияЭлемент.Ссылка = ДанныеИзделияЗаказчика.ИзделиеЗаказчика
	|		ПО ИзделияКомплектИзделияЭлемент.ИзделиеЭлемент = ИзделияЗаказчикаИзделияЭлемент.ИзделиеЭлемент
	|ГДЕ
	|	ИзделияКомплектИзделияЭлемент.Ссылка В(&мИзделиеКомплект)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеКомплекта.Комплект КАК Комплект,
	|	ДанныеКомплекта.ТекущаяСтадия.ОсновнойЭтап КАК ОсновнойЭтап,
	|	МАКСИМУМ(ДанныеКомплекта.Период) КАК Начало
	|ИЗ
	|	РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
	|ГДЕ
	|	ДанныеКомплекта.Комплект В(&Комплект)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеКомплекта.Комплект,
	|	ДанныеКомплекта.ТекущаяСтадия.ОсновнойЭтап
	|
	|УПОРЯДОЧИТЬ ПО
	|	Начало";
	
	Запрос.УстановитьПараметр("СтатусЗамера", 		Перечисления.СтатусыЗамера.Строительный);
	Запрос.УстановитьПараметр("Комплект", 			мКомплект);
	Запрос.УстановитьПараметр("мИзделиеКомплект", 	мИзделиеКомплект);
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[0].Выбрать();
	
	тзЭтапы = Результат[3].Выгрузить();
	тзЭтапы.Индексы.Добавить("Комплект");
	
	ОтборЭтапа = Новый Структура("ОсновнойЭтап, Комплект", Перечисления.ОсновныеЭтапы.Согласование); 
	
	Пока Выборка.Следующий() Цикл
		
		НайденаяСтрока = тзДанные.Найти(Выборка.Комплект, "КомплектКомпозиция");
		НайденаяСтрока.Согласовано = Выборка.ДатаСогласования;
		НайденаяСтрока.СогласованоАрхитектор = ?(Выборка.ДатаСогласованияАрхитектором = ПустаяДата, "", Формат(Выборка.ДатаСогласованияАрхитектором, "ДФ=dd.MM.yyyy"))
		+ " / "
		+ ?(Выборка.ДатаСогласованияЗаказчиком = ПустаяДата, "", Формат(Выборка.ДатаСогласованияЗаказчиком, "ДФ=dd.MM.yyyy"));
		
		
		ОтборЭтапа.Комплект = Выборка.Комплект;
		НайденыеСтроки = тзЭтапы.НайтиСтроки(ОтборЭтапа); 
		
		Для каждого СтрокаЭтапа Из НайденыеСтроки Цикл
			СтрокаЭтапа.Начало = Выборка.ДатаСогласования;		
		КонецЦикла;
	КонецЦикла;
	
	//Выборка = Результат[1].Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	НайденаяСтрока = тзДанные.Найти(Выборка.Комплект, "КомплектКомпозиция");
	//	
	//	Если НайденаяСтрока.Согласовано = ПустаяДата Тогда
	//		ДатаРасчета = ТД;
	//	ИначеЕсли  Выборка.ДатаПринятияПомещения = ПустаяДата Тогда	
	//		ДатаРасчета = ТД; 
	//	Иначе
	//		ДатаРасчета = Макс(НайденаяСтрока.Согласовано, Выборка.ДатаПринятияПомещения);
	//	КонецЕсли;
	//	
	//	НайденаяСтрока.Договор = ДатаРасчета 
	//	+ Выборка.СрокПроизводстваВНеделях * СекундВНеделе
	//	+ Выборка.СрокМонтажаВНеделях * СекундВНеделе; 
	//	
	//КонецЦикла;
	
	Выборка = Результат[2].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НайденаяСтрока = тзДанные.Найти(Выборка.Комплект, "КомплектКомпозиция");
		Если НЕ ПустаяСтрока(НайденаяСтрока.ИзделиеЗаказчика) Тогда
			НайденаяСтрока.ИзделиеЗаказчика = НайденаяСтрока.ИзделиеЗаказчика + ", " + Символы.ПС;
		КонецЕсли;
		НайденаяСтрока.ИзделиеЗаказчика = НайденаяСтрока.ИзделиеЗаказчика + Выборка.ИзделияЗаказчикаНаименование;
	КонецЦикла;
	
	Возврат тзДанные;
	
КонецФункции 

Функция ПолучитьСтатусПроверки(текСтатусЗамера)
	
	Если текСтатусЗамера.СтатусЗамера = Перечисления.СтатусыЗамера.Проектный Тогда
		Возврат "Проектный";	
	КонецЕсли;
	
	СтатусЗамера = Строка(текСтатусЗамера.СтатусЗамера);
	
	Если НЕ текСтатусЗамера.Дата = Дата(1, 1, 1) Тогда
		СтатусЗамера = СтатусЗамера + " (" + Формат(текСтатусЗамера.Дата, "ДЛФ=DD") + ")";	
	КонецЕсли;
	
	
	Возврат СтатусЗамера;
	
КонецФункции // ПолучитьСтатусПроверки()

Функция ЗаполнитьКомплектыИзделий(Проекты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИзделияКомплект.Ссылка КАК ИзделиеКомплект,
	|	ВЫБОР
	|		КОГДА ИзделияКомплект.Родитель.Композиция ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ИзделияКомплект.Родитель.Композиция.Наименование
	|	КОНЕЦ КАК КомпозицииНаименование,
	|	ВЫБОР
	|		КОГДА ИзделияКомплект.Родитель.Композиция ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Композиции.ПустаяСсылка)
	|		ИНАЧЕ ИзделияКомплект.Родитель.Композиция
	|	КОНЕЦ КАК Композиция,
	|	ВЫБОР
	|		КОГДА ИзделияКомплект.Родитель.Композиция ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Помещения.ПустаяСсылка)
	|		ИНАЧЕ ИзделияКомплект.Родитель.Композиция.ОсновноеПомещение
	|	КОНЕЦ КАК ПомещениеКомпозиции,
	|	ВЫБОР
	|		КОГДА ИзделияКомплект.Родитель.Композиция.ОсновноеПомещение ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(ИзделияКомплект.Родитель.Композиция.ОсновноеПомещение.Наименование, """")
	|	КОНЕЦ КАК ПомещениеКомпозицииНаименование,
	|	ИзделияКомплект.ОсновноеПомещение КАК Помещение,
	|	ВЫБОР
	|		КОГДА ИзделияКомплект.ОсновноеПомещение = ЗНАЧЕНИЕ(Справочник.Помещения.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ ИзделияКомплект.ОсновноеПомещение.Наименование
	|	КОНЕЦ КАК ПомещениеНаименование,
	|	ИзделияКомплект.Наименование КАК КомплектНаименование,
	|	ДанныеКомплектаСрезПоследних.Приоритет КАК Приоритет,
	|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия.ПолноеНаименование КАК ТекущаяСтадияСтрока,
	|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия,
	|	ДанныеКомплектаСрезПоследних1.Приоритет КАК ПриоритетКомпозиция,
	|	ДанныеКомплектаСрезПоследних1.ТекущаяСтадия.ПолноеНаименование КАК ТекущаяСтадияКомпозицияСтрока,
	|	ДанныеКомплектаСрезПоследних1.ТекущаяСтадия КАК ТекущаяСтадияКомпозиция,
	|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеМонтажа КАК ВнешняяДатаОкончаниеМонтажа,
	|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеПроектирования КАК ВнешняяДатаОкончаниеПроектирования,
	|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеПроизводства КАК ВнешняяДатаОкончаниеПроизводства,
	|	ДанныеКомплектаСрезПоследних1.ВнешняяДатаОкончаниеПроектирования КАК ВнешняяДатаОкончаниеПроектированияКомпозиции,
	|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия.ОсновнойЭтап КАК ОсновнойЭтап,
	|	ДанныеКомплектаСрезПоследних1.ТекущаяСтадия.ОсновнойЭтап КАК ОсновнойЭтапКомпозиции,
	|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеТЗ КАК ВнешняяДатаОкончаниеТЗ,
	|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеСогласования КАК ВнешняяДатаОкончаниеСогласования,
	|	ДанныеКомплектаСрезПоследних1.ВнешняяДатаОкончаниеТЗ КАК ВнешняяДатаОкончаниеТЗКомпозиции,
	|	ДанныеКомплектаСрезПоследних1.ВнешняяДатаОкончаниеСогласования КАК ВнешняяДатаОкончаниеСогласованияКомпозиции,
	|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеРКД КАК ВнешняяДатаОкончаниеРКД,
	|	ДатыКомплекта.ПереходРедакция КАК ПереходРедакция,
	|	ДатыКомплекта.СогласованДизайнером КАК СогласованДизайнером,
	|	ДатыКомплекта1.ПереходРедакция КАК ПереходРедакцияКомпозиции,
	|	ИзделияКомплект.Проект КАК Проект,
	|	ИзделияКомплект.Проект.Номер КАК ПроектНомер,
	|	ИзделияКомплект.Проект.Наименование КАК ПроектНаименование,
	|	ДатыКомплекта.ПереходПредставление КАК ПереходПредставление,
	|	ДатыКомплекта1.ПереходПредставление КАК ПереходПредставлениеКомпозиции,
	|	НазначениеПодрядчикаКомплекты.ПКД КАК ПодрядПроект,
	|	НазначениеПодрядчикаКомплекты.РКД КАК ПодрядРКД,
	|	НазначениеПодрядчикаКомплекты.Производство КАК ПодрядПроизводство,
	|	НазначениеПодрядчикаКомплекты1.ПКД КАК ПодрядПроектКомпозиции,
	|	НазначениеПодрядчикаКомплекты1.РКД КАК ПодрядРКДКомпозиции,
	|	НазначениеПодрядчикаКомплекты1.Производство КАК ПодрядПроизводствоКомпозиции
	|ИЗ
	|	Справочник.ИзделияКомплект КАК ИзделияКомплект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
	|		ПО (ДанныеКомплектаСрезПоследних.Комплект = ИзделияКомплект.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних1
	|		ПО (ДанныеКомплектаСрезПоследних1.Комплект = ИзделияКомплект.Родитель.Композиция)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
	|		ПО (ДатыКомплекта.Комплект = ИзделияКомплект.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта1
	|		ПО (ДатыКомплекта1.Комплект = ИзделияКомплект.Родитель.Композиция)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НазначениеПодрядчика.Комплекты КАК НазначениеПодрядчикаКомплекты
	|		ПО НазначениеПодрядчикаКомплекты.Комплект = ИзделияКомплект.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НазначениеПодрядчика.Комплекты КАК НазначениеПодрядчикаКомплекты1
	|		ПО НазначениеПодрядчикаКомплекты1.Комплект = ИзделияКомплект.Родитель.Композиция
	|ГДЕ
	|	ИзделияКомплект.Проект В(&Проекты)
	|	И НЕ ИзделияКомплект.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПроектНомер,
	|	КомпозицииНаименование,
	|	КомплектНаименование";
	
	Запрос.УстановитьПараметр("Проекты", Проекты);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции // ЗаполнитьКомплектыИзделий()

Процедура ВывестиДанные(стТаблицы, ПолеВывода)
	
	КоличествоСекундВДне 	= 3600 * 24;
	ПустаяДата				= Дата(1, 1, 1);
	СекундВНеделе			= КоличествоСекундВДне * 7;
	ТД						= НачалоДня(ТекущаяДата());

	Макет = Отчеты.СостояниеПроекта.ПолучитьМакет("Макет");
	МассивОбластей = ПолучитьОбласти();
	
	тзЭтапы = стТаблицы.тзЭтапы;
	
	ПолеВывода.Очистить();
	
	ПолеВывода.РазмерСтраницы = "A3";
	ПолеВывода.АвтоМасштаб 			= Ложь;
	ПолеВывода.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	
	обШапка 	= Макет.ПолучитьОбласть("Шапка");
	обСтрока 	= Макет.ПолучитьОбласть("Строка"); 
	обПроект 	= Макет.ПолучитьОбласть("Проект");
	
	ПолеВывода.ФиксацияСлева = 3;
	
	МассивОбластейДляВывода = Новый Массив;
	МассивОбластейДляВывода.Добавить(обШапка);
	
	стЦвета = Новый Структура();
	
	стЦвета.Вставить("ЦветКопозиция", 					 Новый Цвет(240, 240, 240));
	стЦвета.Вставить("ЦветКопозицияТекущая", 			 Новый Цвет(220, 220, 250));
	стЦвета.Вставить("ЦветКопозицияВниманиеПрошедшие", 	 стЦвета.ЦветКопозиция);
	стЦвета.Вставить("ЦветКопозицияВниманиеТекущие", 	 Новый Цвет(250, 250, 175));
	стЦвета.Вставить("ЦветКопозицияОпазданиеПрошедшие",  стЦвета.ЦветКопозиция);
	стЦвета.Вставить("ЦветКопозицияОпазданиеТекущие", 	 Новый Цвет(250, 220, 220));
	
	стЦвета.Вставить("ЦветКомплекта", 					 Новый Цвет(255, 255, 255));
	стЦвета.Вставить("ЦветКомплектаТекущая", 			 Новый Цвет(220, 220, 255));
	стЦвета.Вставить("ЦветКомплектВниманиеПрошедшие", 	 стЦвета.ЦветКомплекта);
	стЦвета.Вставить("ЦветКомплектВниманиеТекущие", 	 Новый Цвет(255, 250, 175));
	стЦвета.Вставить("ЦветКомплектОпазданиеПрошедшие", 	 стЦвета.ЦветКомплекта);
	стЦвета.Вставить("ЦветКомплектОпазданиеТекущие", 	 Новый Цвет(255, 220, 220)); 
	
	стЦвета.Вставить("ЦветКомплектВМонтаже", 	 		Новый Цвет(220, 255, 220)); 
	стЦвета.Вставить("ЦветКомплектЧастичнаяОтгрузка",	Новый Цвет(240, 255, 240)); 
	
	стОборКомплект 	= Новый Структура("Комплект", );
	ДнейДоОкончания = 0;
	СтадияЗавершениеПКД = омСтадииКомплекта.ПолучитьСтадиюОкончаниеПКД();
	
	Для каждого текСтрока Из стТаблицы.тзДанные Цикл
		
		Если ЗначениеЗаполнено(текСтрока.ПроектНаименование) Тогда
			обПроект.Параметры.Заполнить(текСтрока); 
			текОбласть = обПроект; 
		Иначе
			обСтрока.Параметры.Заполнить(текСтрока); 
			текОбласть = обСтрока;
			
			Если текСтрока.ЭтоКомпозиция Тогда
				ТекущийЦветФона = стЦвета.ЦветКопозиция;
			Иначе
				ТекущийЦветФона = стЦвета.ЦветКомплекта;
			КонецЕсли;
			
			ТекущийИндексОбласти = ПолучитьИндексЭтапа(текСтрока.ОсновнойЭтап);
			
			Для каждого ТекущаяОбласть Из текОбласть.Области Цикл
				
				ИндексОбласти = МассивОбластей.Найти(ТекущаяОбласть.Имя);
				Если ИндексОбласти = Неопределено Тогда
					Продолжить;
				КонецЕсли; 
				
				ТекущаяОбласть.Узор = ТипУзораТабличногоДокумента.БезУзора;
				
				Если (ТекущийИндексОбласти < ИндексОбласти И НЕ ИндексОбласти = 12) ИЛИ текСтрока.Состояние = СтадияЗавершениеПКД Тогда    
					ТекущаяОбласть.ЦветФона = ТекущийЦветФона;
				ИначеЕсли ИндексОбласти = 12  Тогда
					
					Если НЕ ТекущийИндексОбласти = 12 Тогда
						ТекущаяОбласть.ЦветФона = ТекущийЦветФона;
					ИначеЕсли текСтрока.ОтгрузкаЧислом = 1 Тогда
						ТекущаяОбласть.ЦветФона = стЦвета.ЦветКомплектЧастичнаяОтгрузка;
						ТекущаяОбласть.Узор = ТипУзораТабличногоДокумента.Узор3;
					ИначеЕсли текСтрока.ОтгрузкаЧислом = 2 Тогда
						ТекущаяОбласть.Узор = ТипУзораТабличногоДокумента.БезУзора;
						ТекущаяОбласть.ЦветФона = стЦвета.ЦветКомплектВМонтаже;
					Иначе
						ТекущаяОбласть.ЦветФона = ТекущийЦветФона;
					КонецЕсли;
				Иначе	
					
					СтруктураЭтапов = ПолучитьЭтапПоИндексуОбласти(ИндексОбласти, текСтрока);
					
					Если СтруктураЭтапов = Неопределено Тогда
						ТекущаяОбласть.ЦветФона = ТекущийЦветФона;
					Иначе
						
						ТекущаяОбласть.ЦветФона = ПолучитьЦветФона(текСтрока, ИндексОбласти, тзЭтапы, стОборКомплект, ТекущийЦветФона, стЦвета, СтруктураЭтапов, КоличествоСекундВДне, ПустаяДата, СекундВНеделе, ТД, ДнейДоОкончания);
						
						Если ЗначениеЗаполнено(текОбласть.Параметры[СтруктураЭтапов.ИмяПараметра]) Тогда
							
							текОбласть.Параметры[СтруктураЭтапов.ИмяПараметра] 
							= Формат(текОбласть.Параметры[СтруктураЭтапов.ИмяПараметра], "ДФ=dd.MM.yy") + " [" + ДнейДоОкончания + "]";
							
						КонецЕсли;					
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ПроверитьВывод(МассивОбластейДляВывода, текОбласть, обШапка, ПолеВывода);
		
		обСтрока 	= Макет.ПолучитьОбласть("Строка"); 
		обПроект 	= Макет.ПолучитьОбласть("Проект");
		
	КонецЦикла;
	
	Для каждого ТекущаяОбласть Из МассивОбластейДляВывода Цикл
		ПолеВывода.Вывести(ТекущаяОбласть);
	КонецЦикла;
	
КонецПроцедуры // ВывестиДанные()

Функция ПроверитьВывод(МассивОбластейДляВывода, текОбласть, обШапка, ПолеВывода)
	
	МассивОбластейДляВывода.Добавить(текОбласть);
	
	ВременнаяТаблица = Новый ТабличныйДокумент;
	Для каждого ТекущаяОбласть Из МассивОбластейДляВывода Цикл
		ВременнаяТаблица.Вывести(ТекущаяОбласть);
	КонецЦикла;
	
	Если НЕ ПолеВывода.ПроверитьВывод(ВременнаяТаблица) Тогда
		
		МаксимальныйИндекс = МассивОбластейДляВывода.Количество() - 1;
		
		МассивОбластейДляВывода.Удалить(МаксимальныйИндекс);
		
		Для х = 0 По МаксимальныйИндекс - 1 Цикл
			ПолеВывода.Вывести(МассивОбластейДляВывода[х]);
		КонецЦикла;
		
		ПолеВывода.ВывестиГоризонтальныйРазделительСтраниц();
		
		МассивОбластейДляВывода.Очистить();
		
		МассивОбластейДляВывода.Добавить(обШапка);
		МассивОбластейДляВывода.Добавить(текОбласть);
		
	КонецЕсли;
	
КонецФункции // ПроверитьВывод()

Функция ПолучитьЦветФона(текСтрока, ИндексОбласти, тзЭтапы, стОборКомплект, ТекущийЦветФона, стЦвета, СтруктураЭтапов, КоличествоСекундВДне, ПустаяДата, СекундВНеделе, ТД, ДнейДоОкончания);
	
	Если ИндексОбласти < 7 ИЛИ ИндексОбласти > 12 Тогда
		Возврат ТекущийЦветФона;
	КонецЕсли;
	
	стОборКомплект.Комплект 	= текСтрока.КомплектКомпозиция;
	
	Если СтруктураЭтапов = Неопределено Тогда
		Возврат ТекущийЦветФона;
	КонецЕсли;
	
	НайденыеСтроки = тзЭтапы.НайтиСтроки(стОборКомплект);
	
	КоличествоЭтапов = НайденыеСтроки.Количество();
	
	Если КоличествоЭтапов = 0 Тогда
		Возврат ТекущийЦветФона;
	КонецЕсли; 
	
	КоличествоЭтапов = КоличествоЭтапов -1; 
	
	ТекущиЭтап = Ложь;
	ОкончаниеЭтапа = Дата(1, 1, 1);
	
	ЕстьЭтап = Ложь;
	
	Для х = 0 по КоличествоЭтапов Цикл
		
		Если НЕ СтруктураЭтапов.ОсновнойЭтап = НайденыеСтроки[х].ОсновнойЭтап Тогда
			Продолжить;	
		КонецЕсли;
		
		Если х = КоличествоЭтапов ИЛИ текСтрока.ОсновнойЭтап = НайденыеСтроки[х].ОсновнойЭтап Тогда
			ТекущиЭтап = Истина;
		Иначе
			ОкончаниеЭтапа = НачалоДня(НайденыеСтроки[х + 1].Начало);
		КонецЕсли;
		
		ЕстьЭтап = Истина;
		
		Прервать;
		
	КонецЦикла; 
	
	Если НЕ ЕстьЭтап Тогда
		Возврат ТекущийЦветФона;
	КонецЕсли;
	
	Если ТекущиЭтап Тогда
		
		Если ТД < (СтруктураЭтапов.КрайняяДата - СекундВНеделе) Тогда
			
			Если текСтрока.ЭтоКомпозиция Тогда
				НовыйЦветФона = стЦвета.ЦветКопозицияТекущая;
			Иначе
				НовыйЦветФона = стЦвета.ЦветКомплектаТекущая;
			КонецЕсли;
			
		ИначеЕсли ТД < СтруктураЭтапов.КрайняяДата Тогда
			
			Если текСтрока.ЭтоКомпозиция Тогда
				НовыйЦветФона = стЦвета.ЦветКопозицияВниманиеТекущие;
			Иначе
				НовыйЦветФона = стЦвета.ЦветКомплектВниманиеТекущие;
			КонецЕсли;				
			
		Иначе
			
			Если текСтрока.ЭтоКомпозиция Тогда
				НовыйЦветФона = стЦвета.ЦветКопозицияОпазданиеТекущие;
			Иначе
				НовыйЦветФона = стЦвета.ЦветКомплектОпазданиеТекущие;
			КонецЕсли;				
			
		КонецЕсли;
		
		Если СтруктураЭтапов.КрайняяДата = ПустаяДата Тогда
			ДнейДоОкончания = "";
		Иначе	
			ДнейДоОкончания =  Окр((СтруктураЭтапов.КрайняяДата - ТД) / КоличествоСекундВДне, 0);
		КонецЕсли;
		
	Иначе
		
		Если ОкончаниеЭтапа < (СтруктураЭтапов.КрайняяДата - СекундВНеделе) Тогда
			
			Если текСтрока.ЭтоКомпозиция Тогда
				НовыйЦветФона = стЦвета.ЦветКопозиция;
			Иначе
				НовыйЦветФона = стЦвета.ЦветКомплекта;
			КонецЕсли;				
			
		ИначеЕсли ОкончаниеЭтапа < СтруктураЭтапов.КрайняяДата Тогда
			
			Если текСтрока.ЭтоКомпозиция Тогда
				НовыйЦветФона = стЦвета.ЦветКопозицияВниманиеПрошедшие;
			Иначе
				НовыйЦветФона = стЦвета.ЦветКомплектВниманиеПрошедшие;
			КонецЕсли;				
			
		Иначе
			
			Если текСтрока.ЭтоКомпозиция Тогда
				НовыйЦветФона = стЦвета.ЦветКопозицияОпазданиеПрошедшие;
			Иначе
				НовыйЦветФона = стЦвета.ЦветКомплектОпазданиеПрошедшие;
			КонецЕсли;				
			
		КонецЕсли;	
		
		Если СтруктураЭтапов.КрайняяДата = ПустаяДата Тогда
			ДнейДоОкончания = "";
		Иначе	
			ДнейДоОкончания =  Окр((СтруктураЭтапов.КрайняяДата - ОкончаниеЭтапа) / КоличествоСекундВДне, 0);
		КонецЕсли;
		
	КонецЕсли;
	
	
	Возврат НовыйЦветФона;
	
КонецФункции // ПолучитьЦветФона(текСтрока, ИндексОбласти, тзЭтапы, стОборКомплект)

Функция ПолучитьЭтапПоИндексуОбласти(ИндексОбласти, текСтрока)
	
	Если ИндексОбласти = 7 Тогда
		Возврат Новый Структура("ОсновнойЭтап, КрайняяДата, ИмяПараметра"
		, Перечисления.ОсновныеЭтапы.ТЗ, текСтрока.КрайТЗ, "КрайТЗ");
	ИначеЕсли ИндексОбласти = 8 Тогда
		Возврат Новый Структура("ОсновнойЭтап, КрайняяДата, ИмяПараметра"
		, Перечисления.ОсновныеЭтапы.ПКД, текСтрока.КрайПроектирование, "КрайПроектирование");
	ИначеЕсли ИндексОбласти = 9 Тогда
		Возврат Новый Структура("ОсновнойЭтап, КрайняяДата, ИмяПараметра"
		, Перечисления.ОсновныеЭтапы.Согласование, текСтрока.КрайСогласования, "КрайСогласования");
	ИначеЕсли ИндексОбласти = 10 Тогда
		Возврат Новый Структура("ОсновнойЭтап, КрайняяДата, ИмяПараметра"
		, Перечисления.ОсновныеЭтапы.РКД, текСтрока.КрайРКД, "КрайРКД");
	ИначеЕсли ИндексОбласти = 11 Тогда
		Возврат Новый Структура("ОсновнойЭтап, КрайняяДата, ИмяПараметра"
		, Перечисления.ОсновныеЭтапы.Производство, текСтрока.КрайПроизводство, "КрайПроизводство");
	ИначеЕсли ИндексОбласти = 12 Тогда
		Возврат Новый Структура("ОсновнойЭтап, КрайняяДата, ИмяПараметра"
		, Перечисления.ОсновныеЭтапы.Монтаж, текСтрока.КрайМонтаж, "КрайМонтаж");
	КонецЕсли;
	
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьЭтапПоИндексуОбласти(ИндексОбласти) 

Функция ПолучитьИндексЭтапа(ОсновнойЭтап)
	
	Если ОсновнойЭтап = Перечисления.ОсновныеЭтапы.ТЗ Тогда
		Возврат 7;
	ИначеЕсли ОсновнойЭтап = Перечисления.ОсновныеЭтапы.ПКД Тогда
		Возврат 8;
	ИначеЕсли ОсновнойЭтап = Перечисления.ОсновныеЭтапы.Согласование Тогда
		Возврат 9;
	ИначеЕсли ОсновнойЭтап = Перечисления.ОсновныеЭтапы.РКД Тогда
		Возврат 10;
	ИначеЕсли ОсновнойЭтап = Перечисления.ОсновныеЭтапы.Производство Тогда
		Возврат 11;
	ИначеЕсли ОсновнойЭтап = Перечисления.ОсновныеЭтапы.Монтаж Тогда
		Возврат 12;
	КонецЕсли;
	
	Возврат 0;
КонецФункции // ПолучитьИндексЭтапа()

Функция ПолучитьОбласти()
	
	МассивОбластей = Новый Массив(14);
	МассивОбластей[0] = "ОбластьНомер";
	МассивОбластей[1] = "ОбластьКомплект";
	МассивОбластей[2] = "ОбластьИзделиеЗаказчика";
	МассивОбластей[3] = "ОбластьПомещение";
	МассивОбластей[4] = "ОбластьСогласовано";
	МассивОбластей[5] = "ОбластьПриоритет";
	МассивОбластей[6] = "ОбластьСостояние";
	МассивОбластей[7] = "ОбластьКрайТЗ";
	МассивОбластей[8] = "ОбластьКрайПроектирование";
	МассивОбластей[9] = "ОбластьКрайСогласования";
	МассивОбластей[10] = "ОбластьКрайРКД";
	МассивОбластей[11] = "ОбластьКрайПроизводство";
	МассивОбластей[12] = "ОбластьКрайМонтаж";
	МассивОбластей[13] = "ОбластьДоговор";
	
	Возврат МассивОбластей;
	
КонецФункции // ПолучитьОбласти()
